MikroElektronika/core_packages/PIC/XC8/def/PIC18F46Q10/mcu.h
// Register: CLC8SEL0
#define CLC8SEL0 CLC8SEL0
extern volatile unsigned char           CLC8SEL0            __at(0xE6F);
#ifndef _LIB_BUILD
asm("CLC8SEL0 equ 0E6Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned D1S                    :8;
    };
    struct {
        unsigned LC8D1S                 :8;
    };
    struct {
        unsigned D1S0                   :1;
        unsigned D1S1                   :1;
        unsigned D1S2                   :1;
        unsigned D1S3                   :1;
        unsigned D1S4                   :1;
        unsigned D1S5                   :1;
        unsigned D1S6                   :1;
        unsigned D1S7                   :1;
    };
    struct {
        unsigned LC8D1S0                :1;
        unsigned LC8D1S1                :1;
        unsigned LC8D1S2                :1;
        unsigned LC8D1S3                :1;
        unsigned LC8D1S4                :1;
        unsigned LC8D1S5                :1;
        unsigned LC8D1S6                :1;
        unsigned LC8D1S7                :1;
    };
} CLC8SEL0bits_t;
extern volatile CLC8SEL0bits_t CLC8SEL0bits __at(0xE6F);
// bitfield macros
#define _CLC8SEL0_D1S_POSN                                  0x0
#define _CLC8SEL0_D1S_POSITION                              0x0
#define _CLC8SEL0_D1S_SIZE                                  0x8
#define _CLC8SEL0_D1S_LENGTH                                0x8
#define _CLC8SEL0_D1S_MASK                                  0xFF
#define _CLC8SEL0_LC8D1S_POSN                               0x0
#define _CLC8SEL0_LC8D1S_POSITION                           0x0
#define _CLC8SEL0_LC8D1S_SIZE                               0x8
#define _CLC8SEL0_LC8D1S_LENGTH                             0x8
#define _CLC8SEL0_LC8D1S_MASK                               0xFF
#define _CLC8SEL0_D1S0_POSN                                 0x0
#define _CLC8SEL0_D1S0_POSITION                             0x0
#define _CLC8SEL0_D1S0_SIZE                                 0x1
#define _CLC8SEL0_D1S0_LENGTH                               0x1
#define _CLC8SEL0_D1S0_MASK                                 0x1
#define _CLC8SEL0_D1S1_POSN                                 0x1
#define _CLC8SEL0_D1S1_POSITION                             0x1
#define _CLC8SEL0_D1S1_SIZE                                 0x1
#define _CLC8SEL0_D1S1_LENGTH                               0x1
#define _CLC8SEL0_D1S1_MASK                                 0x2
#define _CLC8SEL0_D1S2_POSN                                 0x2
#define _CLC8SEL0_D1S2_POSITION                             0x2
#define _CLC8SEL0_D1S2_SIZE                                 0x1
#define _CLC8SEL0_D1S2_LENGTH                               0x1
#define _CLC8SEL0_D1S2_MASK                                 0x4
#define _CLC8SEL0_D1S3_POSN                                 0x3
#define _CLC8SEL0_D1S3_POSITION                             0x3
#define _CLC8SEL0_D1S3_SIZE                                 0x1
#define _CLC8SEL0_D1S3_LENGTH                               0x1
#define _CLC8SEL0_D1S3_MASK                                 0x8
#define _CLC8SEL0_D1S4_POSN                                 0x4
#define _CLC8SEL0_D1S4_POSITION                             0x4
#define _CLC8SEL0_D1S4_SIZE                                 0x1
#define _CLC8SEL0_D1S4_LENGTH                               0x1
#define _CLC8SEL0_D1S4_MASK                                 0x10
#define _CLC8SEL0_D1S5_POSN                                 0x5
#define _CLC8SEL0_D1S5_POSITION                             0x5
#define _CLC8SEL0_D1S5_SIZE                                 0x1
#define _CLC8SEL0_D1S5_LENGTH                               0x1
#define _CLC8SEL0_D1S5_MASK                                 0x20
#define _CLC8SEL0_D1S6_POSN                                 0x6
#define _CLC8SEL0_D1S6_POSITION                             0x6
#define _CLC8SEL0_D1S6_SIZE                                 0x1
#define _CLC8SEL0_D1S6_LENGTH                               0x1
#define _CLC8SEL0_D1S6_MASK                                 0x40
#define _CLC8SEL0_D1S7_POSN                                 0x7
#define _CLC8SEL0_D1S7_POSITION                             0x7
#define _CLC8SEL0_D1S7_SIZE                                 0x1
#define _CLC8SEL0_D1S7_LENGTH                               0x1
#define _CLC8SEL0_D1S7_MASK                                 0x80
#define _CLC8SEL0_LC8D1S0_POSN                              0x0
#define _CLC8SEL0_LC8D1S0_POSITION                          0x0
#define _CLC8SEL0_LC8D1S0_SIZE                              0x1
#define _CLC8SEL0_LC8D1S0_LENGTH                            0x1
#define _CLC8SEL0_LC8D1S0_MASK                              0x1
#define _CLC8SEL0_LC8D1S1_POSN                              0x1
#define _CLC8SEL0_LC8D1S1_POSITION                          0x1
#define _CLC8SEL0_LC8D1S1_SIZE                              0x1
#define _CLC8SEL0_LC8D1S1_LENGTH                            0x1
#define _CLC8SEL0_LC8D1S1_MASK                              0x2
#define _CLC8SEL0_LC8D1S2_POSN                              0x2
#define _CLC8SEL0_LC8D1S2_POSITION                          0x2
#define _CLC8SEL0_LC8D1S2_SIZE                              0x1
#define _CLC8SEL0_LC8D1S2_LENGTH                            0x1
#define _CLC8SEL0_LC8D1S2_MASK                              0x4
#define _CLC8SEL0_LC8D1S3_POSN                              0x3
#define _CLC8SEL0_LC8D1S3_POSITION                          0x3
#define _CLC8SEL0_LC8D1S3_SIZE                              0x1
#define _CLC8SEL0_LC8D1S3_LENGTH                            0x1
#define _CLC8SEL0_LC8D1S3_MASK                              0x8
#define _CLC8SEL0_LC8D1S4_POSN                              0x4
#define _CLC8SEL0_LC8D1S4_POSITION                          0x4
#define _CLC8SEL0_LC8D1S4_SIZE                              0x1
#define _CLC8SEL0_LC8D1S4_LENGTH                            0x1
#define _CLC8SEL0_LC8D1S4_MASK                              0x10
#define _CLC8SEL0_LC8D1S5_POSN                              0x5
#define _CLC8SEL0_LC8D1S5_POSITION                          0x5
#define _CLC8SEL0_LC8D1S5_SIZE                              0x1
#define _CLC8SEL0_LC8D1S5_LENGTH                            0x1
#define _CLC8SEL0_LC8D1S5_MASK                              0x20
#define _CLC8SEL0_LC8D1S6_POSN                              0x6
#define _CLC8SEL0_LC8D1S6_POSITION                          0x6
#define _CLC8SEL0_LC8D1S6_SIZE                              0x1
#define _CLC8SEL0_LC8D1S6_LENGTH                            0x1
#define _CLC8SEL0_LC8D1S6_MASK                              0x40
#define _CLC8SEL0_LC8D1S7_POSN                              0x7
#define _CLC8SEL0_LC8D1S7_POSITION                          0x7
#define _CLC8SEL0_LC8D1S7_SIZE                              0x1
#define _CLC8SEL0_LC8D1S7_LENGTH                            0x1
#define _CLC8SEL0_LC8D1S7_MASK                              0x80

// Register: CLC8SEL1
#define CLC8SEL1 CLC8SEL1
extern volatile unsigned char           CLC8SEL1            __at(0xE70);
#ifndef _LIB_BUILD
asm("CLC8SEL1 equ 0E70h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned D2S                    :8;
    };
    struct {
        unsigned LC8D2S                 :8;
    };
    struct {
        unsigned D2S0                   :1;
        unsigned D2S1                   :1;
        unsigned D2S2                   :1;
        unsigned D2S3                   :1;
        unsigned D2S4                   :1;
        unsigned D2S5                   :1;
        unsigned D2S6                   :1;
        unsigned D2S7                   :1;
    };
    struct {
        unsigned LC8D2S0                :1;
        unsigned LC8D2S1                :1;
        unsigned LC8D2S2                :1;
        unsigned LC8D2S3                :1;
        unsigned LC8D2S4                :1;
        unsigned LC8D2S5                :1;
        unsigned LC8D2S6                :1;
        unsigned LC8D2S7                :1;
    };
} CLC8SEL1bits_t;
extern volatile CLC8SEL1bits_t CLC8SEL1bits __at(0xE70);
// bitfield macros
#define _CLC8SEL1_D2S_POSN                                  0x0
#define _CLC8SEL1_D2S_POSITION                              0x0
#define _CLC8SEL1_D2S_SIZE                                  0x8
#define _CLC8SEL1_D2S_LENGTH                                0x8
#define _CLC8SEL1_D2S_MASK                                  0xFF
#define _CLC8SEL1_LC8D2S_POSN                               0x0
#define _CLC8SEL1_LC8D2S_POSITION                           0x0
#define _CLC8SEL1_LC8D2S_SIZE                               0x8
#define _CLC8SEL1_LC8D2S_LENGTH                             0x8
#define _CLC8SEL1_LC8D2S_MASK                               0xFF
#define _CLC8SEL1_D2S0_POSN                                 0x0
#define _CLC8SEL1_D2S0_POSITION                             0x0
#define _CLC8SEL1_D2S0_SIZE                                 0x1
#define _CLC8SEL1_D2S0_LENGTH                               0x1
#define _CLC8SEL1_D2S0_MASK                                 0x1
#define _CLC8SEL1_D2S1_POSN                                 0x1
#define _CLC8SEL1_D2S1_POSITION                             0x1
#define _CLC8SEL1_D2S1_SIZE                                 0x1
#define _CLC8SEL1_D2S1_LENGTH                               0x1
#define _CLC8SEL1_D2S1_MASK                                 0x2
#define _CLC8SEL1_D2S2_POSN                                 0x2
#define _CLC8SEL1_D2S2_POSITION                             0x2
#define _CLC8SEL1_D2S2_SIZE                                 0x1
#define _CLC8SEL1_D2S2_LENGTH                               0x1
#define _CLC8SEL1_D2S2_MASK                                 0x4
#define _CLC8SEL1_D2S3_POSN                                 0x3
#define _CLC8SEL1_D2S3_POSITION                             0x3
#define _CLC8SEL1_D2S3_SIZE                                 0x1
#define _CLC8SEL1_D2S3_LENGTH                               0x1
#define _CLC8SEL1_D2S3_MASK                                 0x8
#define _CLC8SEL1_D2S4_POSN                                 0x4
#define _CLC8SEL1_D2S4_POSITION                             0x4
#define _CLC8SEL1_D2S4_SIZE                                 0x1
#define _CLC8SEL1_D2S4_LENGTH                               0x1
#define _CLC8SEL1_D2S4_MASK                                 0x10
#define _CLC8SEL1_D2S5_POSN                                 0x5
#define _CLC8SEL1_D2S5_POSITION                             0x5
#define _CLC8SEL1_D2S5_SIZE                                 0x1
#define _CLC8SEL1_D2S5_LENGTH                               0x1
#define _CLC8SEL1_D2S5_MASK                                 0x20
#define _CLC8SEL1_D2S6_POSN                                 0x6
#define _CLC8SEL1_D2S6_POSITION                             0x6
#define _CLC8SEL1_D2S6_SIZE                                 0x1
#define _CLC8SEL1_D2S6_LENGTH                               0x1
#define _CLC8SEL1_D2S6_MASK                                 0x40
#define _CLC8SEL1_D2S7_POSN                                 0x7
#define _CLC8SEL1_D2S7_POSITION                             0x7
#define _CLC8SEL1_D2S7_SIZE                                 0x1
#define _CLC8SEL1_D2S7_LENGTH                               0x1
#define _CLC8SEL1_D2S7_MASK                                 0x80
#define _CLC8SEL1_LC8D2S0_POSN                              0x0
#define _CLC8SEL1_LC8D2S0_POSITION                          0x0
#define _CLC8SEL1_LC8D2S0_SIZE                              0x1
#define _CLC8SEL1_LC8D2S0_LENGTH                            0x1
#define _CLC8SEL1_LC8D2S0_MASK                              0x1
#define _CLC8SEL1_LC8D2S1_POSN                              0x1
#define _CLC8SEL1_LC8D2S1_POSITION                          0x1
#define _CLC8SEL1_LC8D2S1_SIZE                              0x1
#define _CLC8SEL1_LC8D2S1_LENGTH                            0x1
#define _CLC8SEL1_LC8D2S1_MASK                              0x2
#define _CLC8SEL1_LC8D2S2_POSN                              0x2
#define _CLC8SEL1_LC8D2S2_POSITION                          0x2
#define _CLC8SEL1_LC8D2S2_SIZE                              0x1
#define _CLC8SEL1_LC8D2S2_LENGTH                            0x1
#define _CLC8SEL1_LC8D2S2_MASK                              0x4
#define _CLC8SEL1_LC8D2S3_POSN                              0x3
#define _CLC8SEL1_LC8D2S3_POSITION                          0x3
#define _CLC8SEL1_LC8D2S3_SIZE                              0x1
#define _CLC8SEL1_LC8D2S3_LENGTH                            0x1
#define _CLC8SEL1_LC8D2S3_MASK                              0x8
#define _CLC8SEL1_LC8D2S4_POSN                              0x4
#define _CLC8SEL1_LC8D2S4_POSITION                          0x4
#define _CLC8SEL1_LC8D2S4_SIZE                              0x1
#define _CLC8SEL1_LC8D2S4_LENGTH                            0x1
#define _CLC8SEL1_LC8D2S4_MASK                              0x10
#define _CLC8SEL1_LC8D2S5_POSN                              0x5
#define _CLC8SEL1_LC8D2S5_POSITION                          0x5
#define _CLC8SEL1_LC8D2S5_SIZE                              0x1
#define _CLC8SEL1_LC8D2S5_LENGTH                            0x1
#define _CLC8SEL1_LC8D2S5_MASK                              0x20
#define _CLC8SEL1_LC8D2S6_POSN                              0x6
#define _CLC8SEL1_LC8D2S6_POSITION                          0x6
#define _CLC8SEL1_LC8D2S6_SIZE                              0x1
#define _CLC8SEL1_LC8D2S6_LENGTH                            0x1
#define _CLC8SEL1_LC8D2S6_MASK                              0x40
#define _CLC8SEL1_LC8D2S7_POSN                              0x7
#define _CLC8SEL1_LC8D2S7_POSITION                          0x7
#define _CLC8SEL1_LC8D2S7_SIZE                              0x1
#define _CLC8SEL1_LC8D2S7_LENGTH                            0x1
#define _CLC8SEL1_LC8D2S7_MASK                              0x80

