MikroElektronika/core_packages/PIC/XC8/def/PIC18F46Q10/mcu.h
extern volatile CLCDATAbits_t CLCDATAbits __at(0xE77);
// bitfield macros
#define _CLCDATA_MCL1OUT_POSN                               0x0
#define _CLCDATA_MCL1OUT_POSITION                           0x0
#define _CLCDATA_MCL1OUT_SIZE                               0x1
#define _CLCDATA_MCL1OUT_LENGTH                             0x1
#define _CLCDATA_MCL1OUT_MASK                               0x1
#define _CLCDATA_MLC2OUT_POSN                               0x1
#define _CLCDATA_MLC2OUT_POSITION                           0x1
#define _CLCDATA_MLC2OUT_SIZE                               0x1
#define _CLCDATA_MLC2OUT_LENGTH                             0x1
#define _CLCDATA_MLC2OUT_MASK                               0x2
#define _CLCDATA_MLC3OUT_POSN                               0x2
#define _CLCDATA_MLC3OUT_POSITION                           0x2
#define _CLCDATA_MLC3OUT_SIZE                               0x1
#define _CLCDATA_MLC3OUT_LENGTH                             0x1
#define _CLCDATA_MLC3OUT_MASK                               0x4
#define _CLCDATA_MLC4OUT_POSN                               0x3
#define _CLCDATA_MLC4OUT_POSITION                           0x3
#define _CLCDATA_MLC4OUT_SIZE                               0x1
#define _CLCDATA_MLC4OUT_LENGTH                             0x1
#define _CLCDATA_MLC4OUT_MASK                               0x8
#define _CLCDATA_MLC5OUT_POSN                               0x4
#define _CLCDATA_MLC5OUT_POSITION                           0x4
#define _CLCDATA_MLC5OUT_SIZE                               0x1
#define _CLCDATA_MLC5OUT_LENGTH                             0x1
#define _CLCDATA_MLC5OUT_MASK                               0x10
#define _CLCDATA_MLC6OUT_POSN                               0x5
#define _CLCDATA_MLC6OUT_POSITION                           0x5
#define _CLCDATA_MLC6OUT_SIZE                               0x1
#define _CLCDATA_MLC6OUT_LENGTH                             0x1
#define _CLCDATA_MLC6OUT_MASK                               0x20
#define _CLCDATA_MLC7OUT_POSN                               0x6
#define _CLCDATA_MLC7OUT_POSITION                           0x6
#define _CLCDATA_MLC7OUT_SIZE                               0x1
#define _CLCDATA_MLC7OUT_LENGTH                             0x1
#define _CLCDATA_MLC7OUT_MASK                               0x40
#define _CLCDATA_MLC8OUT_POSN                               0x7
#define _CLCDATA_MLC8OUT_POSITION                           0x7
#define _CLCDATA_MLC8OUT_SIZE                               0x1
#define _CLCDATA_MLC8OUT_LENGTH                             0x1
#define _CLCDATA_MLC8OUT_MASK                               0x80

// Register: RX2PPS
#define RX2PPS RX2PPS
extern volatile unsigned char           RX2PPS              __at(0xE88);
#ifndef _LIB_BUILD
asm("RX2PPS equ 0E88h");
#endif
// aliases
extern volatile unsigned char           RXDT2PPS            __at(0xE88);
#ifndef _LIB_BUILD
asm("RXDT2PPS equ 0E88h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned RX2PPS                 :5;
    };
    struct {
        unsigned RX2PPS0                :1;
        unsigned RX2PPS1                :1;
        unsigned RX2PPS2                :1;
        unsigned RX2PPS3                :1;
        unsigned RX2PPS4                :1;
    };
} RX2PPSbits_t;
extern volatile RX2PPSbits_t RX2PPSbits __at(0xE88);
// bitfield macros
#define _RX2PPS_PIN_POSN                                    0x0
#define _RX2PPS_PIN_POSITION                                0x0
#define _RX2PPS_PIN_SIZE                                    0x3
#define _RX2PPS_PIN_LENGTH                                  0x3
#define _RX2PPS_PIN_MASK                                    0x7
#define _RX2PPS_PORT_POSN                                   0x3
#define _RX2PPS_PORT_POSITION                               0x3
#define _RX2PPS_PORT_SIZE                                   0x2
#define _RX2PPS_PORT_LENGTH                                 0x2
#define _RX2PPS_PORT_MASK                                   0x18
#define _RX2PPS_RX2PPS_POSN                                 0x0
#define _RX2PPS_RX2PPS_POSITION                             0x0
#define _RX2PPS_RX2PPS_SIZE                                 0x5
#define _RX2PPS_RX2PPS_LENGTH                               0x5
#define _RX2PPS_RX2PPS_MASK                                 0x1F
#define _RX2PPS_RX2PPS0_POSN                                0x0
#define _RX2PPS_RX2PPS0_POSITION                            0x0
#define _RX2PPS_RX2PPS0_SIZE                                0x1
#define _RX2PPS_RX2PPS0_LENGTH                              0x1
#define _RX2PPS_RX2PPS0_MASK                                0x1
#define _RX2PPS_RX2PPS1_POSN                                0x1
#define _RX2PPS_RX2PPS1_POSITION                            0x1
#define _RX2PPS_RX2PPS1_SIZE                                0x1
#define _RX2PPS_RX2PPS1_LENGTH                              0x1
#define _RX2PPS_RX2PPS1_MASK                                0x2
#define _RX2PPS_RX2PPS2_POSN                                0x2
#define _RX2PPS_RX2PPS2_POSITION                            0x2
#define _RX2PPS_RX2PPS2_SIZE                                0x1
#define _RX2PPS_RX2PPS2_LENGTH                              0x1
#define _RX2PPS_RX2PPS2_MASK                                0x4
#define _RX2PPS_RX2PPS3_POSN                                0x3
#define _RX2PPS_RX2PPS3_POSITION                            0x3
#define _RX2PPS_RX2PPS3_SIZE                                0x1
#define _RX2PPS_RX2PPS3_LENGTH                              0x1
#define _RX2PPS_RX2PPS3_MASK                                0x8
#define _RX2PPS_RX2PPS4_POSN                                0x4
#define _RX2PPS_RX2PPS4_POSITION                            0x4
#define _RX2PPS_RX2PPS4_SIZE                                0x1
#define _RX2PPS_RX2PPS4_LENGTH                              0x1
#define _RX2PPS_RX2PPS4_MASK                                0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned RX2PPS                 :5;
    };
    struct {
        unsigned RX2PPS0                :1;
        unsigned RX2PPS1                :1;
        unsigned RX2PPS2                :1;
        unsigned RX2PPS3                :1;
        unsigned RX2PPS4                :1;
    };
} RXDT2PPSbits_t;
extern volatile RXDT2PPSbits_t RXDT2PPSbits __at(0xE88);
// bitfield macros
#define _RXDT2PPS_PIN_POSN                                  0x0
#define _RXDT2PPS_PIN_POSITION                              0x0
#define _RXDT2PPS_PIN_SIZE                                  0x3
#define _RXDT2PPS_PIN_LENGTH                                0x3
#define _RXDT2PPS_PIN_MASK                                  0x7
#define _RXDT2PPS_PORT_POSN                                 0x3
#define _RXDT2PPS_PORT_POSITION                             0x3
#define _RXDT2PPS_PORT_SIZE                                 0x2
#define _RXDT2PPS_PORT_LENGTH                               0x2
#define _RXDT2PPS_PORT_MASK                                 0x18
#define _RXDT2PPS_RX2PPS_POSN                               0x0
#define _RXDT2PPS_RX2PPS_POSITION                           0x0
#define _RXDT2PPS_RX2PPS_SIZE                               0x5
#define _RXDT2PPS_RX2PPS_LENGTH                             0x5
#define _RXDT2PPS_RX2PPS_MASK                               0x1F
#define _RXDT2PPS_RX2PPS0_POSN                              0x0
#define _RXDT2PPS_RX2PPS0_POSITION                          0x0
#define _RXDT2PPS_RX2PPS0_SIZE                              0x1
#define _RXDT2PPS_RX2PPS0_LENGTH                            0x1
#define _RXDT2PPS_RX2PPS0_MASK                              0x1
#define _RXDT2PPS_RX2PPS1_POSN                              0x1
#define _RXDT2PPS_RX2PPS1_POSITION                          0x1
#define _RXDT2PPS_RX2PPS1_SIZE                              0x1
#define _RXDT2PPS_RX2PPS1_LENGTH                            0x1
#define _RXDT2PPS_RX2PPS1_MASK                              0x2
#define _RXDT2PPS_RX2PPS2_POSN                              0x2
#define _RXDT2PPS_RX2PPS2_POSITION                          0x2
#define _RXDT2PPS_RX2PPS2_SIZE                              0x1
#define _RXDT2PPS_RX2PPS2_LENGTH                            0x1
#define _RXDT2PPS_RX2PPS2_MASK                              0x4
#define _RXDT2PPS_RX2PPS3_POSN                              0x3
#define _RXDT2PPS_RX2PPS3_POSITION                          0x3
#define _RXDT2PPS_RX2PPS3_SIZE                              0x1
#define _RXDT2PPS_RX2PPS3_LENGTH                            0x1
#define _RXDT2PPS_RX2PPS3_MASK                              0x8
#define _RXDT2PPS_RX2PPS4_POSN                              0x4
#define _RXDT2PPS_RX2PPS4_POSITION                          0x4
#define _RXDT2PPS_RX2PPS4_SIZE                              0x1
#define _RXDT2PPS_RX2PPS4_LENGTH                            0x1
#define _RXDT2PPS_RX2PPS4_MASK                              0x10

// Register: CK2PPS
#define CK2PPS CK2PPS
extern volatile unsigned char           CK2PPS              __at(0xE89);
#ifndef _LIB_BUILD
asm("CK2PPS equ 0E89h");
#endif
// aliases
extern volatile unsigned char           TXCK2PPS            __at(0xE89);
#ifndef _LIB_BUILD
asm("TXCK2PPS equ 0E89h");
#endif
extern volatile unsigned char           TX2PPS              __at(0xE89);
#ifndef _LIB_BUILD
asm("TX2PPS equ 0E89h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned CK2PPS0                :1;
        unsigned CK2PPS1                :1;
        unsigned CK2PPS2                :1;
        unsigned CK2PPS3                :1;
        unsigned CK2PPS4                :1;
    };
    struct {
        unsigned CK2PPS                 :5;
    };
} CK2PPSbits_t;
extern volatile CK2PPSbits_t CK2PPSbits __at(0xE89);
// bitfield macros
#define _CK2PPS_PIN_POSN                                    0x0
#define _CK2PPS_PIN_POSITION                                0x0
#define _CK2PPS_PIN_SIZE                                    0x3
#define _CK2PPS_PIN_LENGTH                                  0x3
#define _CK2PPS_PIN_MASK                                    0x7
#define _CK2PPS_PORT_POSN                                   0x3
#define _CK2PPS_PORT_POSITION                               0x3
#define _CK2PPS_PORT_SIZE                                   0x2
#define _CK2PPS_PORT_LENGTH                                 0x2
#define _CK2PPS_PORT_MASK                                   0x18
#define _CK2PPS_CK2PPS0_POSN                                0x0
#define _CK2PPS_CK2PPS0_POSITION                            0x0
#define _CK2PPS_CK2PPS0_SIZE                                0x1
#define _CK2PPS_CK2PPS0_LENGTH                              0x1
#define _CK2PPS_CK2PPS0_MASK                                0x1
#define _CK2PPS_CK2PPS1_POSN                                0x1
#define _CK2PPS_CK2PPS1_POSITION                            0x1
#define _CK2PPS_CK2PPS1_SIZE                                0x1
#define _CK2PPS_CK2PPS1_LENGTH                              0x1
#define _CK2PPS_CK2PPS1_MASK                                0x2
#define _CK2PPS_CK2PPS2_POSN                                0x2
#define _CK2PPS_CK2PPS2_POSITION                            0x2
#define _CK2PPS_CK2PPS2_SIZE                                0x1
#define _CK2PPS_CK2PPS2_LENGTH                              0x1
#define _CK2PPS_CK2PPS2_MASK                                0x4
#define _CK2PPS_CK2PPS3_POSN                                0x3
#define _CK2PPS_CK2PPS3_POSITION                            0x3
#define _CK2PPS_CK2PPS3_SIZE                                0x1
#define _CK2PPS_CK2PPS3_LENGTH                              0x1
#define _CK2PPS_CK2PPS3_MASK                                0x8
#define _CK2PPS_CK2PPS4_POSN                                0x4
#define _CK2PPS_CK2PPS4_POSITION                            0x4
#define _CK2PPS_CK2PPS4_SIZE                                0x1
#define _CK2PPS_CK2PPS4_LENGTH                              0x1
#define _CK2PPS_CK2PPS4_MASK                                0x10
#define _CK2PPS_CK2PPS_POSN                                 0x0
#define _CK2PPS_CK2PPS_POSITION                             0x0
#define _CK2PPS_CK2PPS_SIZE                                 0x5
#define _CK2PPS_CK2PPS_LENGTH                               0x5
#define _CK2PPS_CK2PPS_MASK                                 0x1F
// alias bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned CK2PPS0                :1;
        unsigned CK2PPS1                :1;
        unsigned CK2PPS2                :1;
        unsigned CK2PPS3                :1;
        unsigned CK2PPS4                :1;
    };
    struct {
        unsigned CK2PPS                 :5;
    };
} TXCK2PPSbits_t;
