MikroElektronika/core_packages/PIC/XC8/def/PIC18F46Q10/mcu.h
extern volatile MDCARHPPSbits_t MDCARHPPSbits __at(0xEAE);
// bitfield macros
#define _MDCARHPPS_PIN_POSN                                 0x0
#define _MDCARHPPS_PIN_POSITION                             0x0
#define _MDCARHPPS_PIN_SIZE                                 0x3
#define _MDCARHPPS_PIN_LENGTH                               0x3
#define _MDCARHPPS_PIN_MASK                                 0x7
#define _MDCARHPPS_PORT_POSN                                0x3
#define _MDCARHPPS_PORT_POSITION                            0x3
#define _MDCARHPPS_PORT_SIZE                                0x2
#define _MDCARHPPS_PORT_LENGTH                              0x2
#define _MDCARHPPS_PORT_MASK                                0x18
#define _MDCARHPPS_MDCARHPPS0_POSN                          0x0
#define _MDCARHPPS_MDCARHPPS0_POSITION                      0x0
#define _MDCARHPPS_MDCARHPPS0_SIZE                          0x1
#define _MDCARHPPS_MDCARHPPS0_LENGTH                        0x1
#define _MDCARHPPS_MDCARHPPS0_MASK                          0x1
#define _MDCARHPPS_MDCARHPPS1_POSN                          0x1
#define _MDCARHPPS_MDCARHPPS1_POSITION                      0x1
#define _MDCARHPPS_MDCARHPPS1_SIZE                          0x1
#define _MDCARHPPS_MDCARHPPS1_LENGTH                        0x1
#define _MDCARHPPS_MDCARHPPS1_MASK                          0x2
#define _MDCARHPPS_MDCARHPPS2_POSN                          0x2
#define _MDCARHPPS_MDCARHPPS2_POSITION                      0x2
#define _MDCARHPPS_MDCARHPPS2_SIZE                          0x1
#define _MDCARHPPS_MDCARHPPS2_LENGTH                        0x1
#define _MDCARHPPS_MDCARHPPS2_MASK                          0x4
#define _MDCARHPPS_MDCARHPPS3_POSN                          0x3
#define _MDCARHPPS_MDCARHPPS3_POSITION                      0x3
#define _MDCARHPPS_MDCARHPPS3_SIZE                          0x1
#define _MDCARHPPS_MDCARHPPS3_LENGTH                        0x1
#define _MDCARHPPS_MDCARHPPS3_MASK                          0x8
#define _MDCARHPPS_MDCARHPPS4_POSN                          0x4
#define _MDCARHPPS_MDCARHPPS4_POSITION                      0x4
#define _MDCARHPPS_MDCARHPPS4_SIZE                          0x1
#define _MDCARHPPS_MDCARHPPS4_LENGTH                        0x1
#define _MDCARHPPS_MDCARHPPS4_MASK                          0x10
#define _MDCARHPPS_MDCARHPPS_POSN                           0x0
#define _MDCARHPPS_MDCARHPPS_POSITION                       0x0
#define _MDCARHPPS_MDCARHPPS_SIZE                           0x5
#define _MDCARHPPS_MDCARHPPS_LENGTH                         0x5
#define _MDCARHPPS_MDCARHPPS_MASK                           0x1F

// Register: MDSRCPPS
#define MDSRCPPS MDSRCPPS
extern volatile unsigned char           MDSRCPPS            __at(0xEAF);
#ifndef _LIB_BUILD
asm("MDSRCPPS equ 0EAFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned MDSRCPPS0              :1;
        unsigned MDSRCPPS1              :1;
        unsigned MDSRCPPS2              :1;
        unsigned MDSRCPPS3              :1;
        unsigned MDSRCPPS4              :1;
    };
    struct {
        unsigned MDSRCPPS               :5;
    };
} MDSRCPPSbits_t;
extern volatile MDSRCPPSbits_t MDSRCPPSbits __at(0xEAF);
// bitfield macros
#define _MDSRCPPS_PIN_POSN                                  0x0
#define _MDSRCPPS_PIN_POSITION                              0x0
#define _MDSRCPPS_PIN_SIZE                                  0x3
#define _MDSRCPPS_PIN_LENGTH                                0x3
#define _MDSRCPPS_PIN_MASK                                  0x7
#define _MDSRCPPS_PORT_POSN                                 0x3
#define _MDSRCPPS_PORT_POSITION                             0x3
#define _MDSRCPPS_PORT_SIZE                                 0x2
#define _MDSRCPPS_PORT_LENGTH                               0x2
#define _MDSRCPPS_PORT_MASK                                 0x18
#define _MDSRCPPS_MDSRCPPS0_POSN                            0x0
#define _MDSRCPPS_MDSRCPPS0_POSITION                        0x0
#define _MDSRCPPS_MDSRCPPS0_SIZE                            0x1
#define _MDSRCPPS_MDSRCPPS0_LENGTH                          0x1
#define _MDSRCPPS_MDSRCPPS0_MASK                            0x1
#define _MDSRCPPS_MDSRCPPS1_POSN                            0x1
#define _MDSRCPPS_MDSRCPPS1_POSITION                        0x1
#define _MDSRCPPS_MDSRCPPS1_SIZE                            0x1
#define _MDSRCPPS_MDSRCPPS1_LENGTH                          0x1
#define _MDSRCPPS_MDSRCPPS1_MASK                            0x2
#define _MDSRCPPS_MDSRCPPS2_POSN                            0x2
#define _MDSRCPPS_MDSRCPPS2_POSITION                        0x2
#define _MDSRCPPS_MDSRCPPS2_SIZE                            0x1
#define _MDSRCPPS_MDSRCPPS2_LENGTH                          0x1
#define _MDSRCPPS_MDSRCPPS2_MASK                            0x4
#define _MDSRCPPS_MDSRCPPS3_POSN                            0x3
#define _MDSRCPPS_MDSRCPPS3_POSITION                        0x3
#define _MDSRCPPS_MDSRCPPS3_SIZE                            0x1
#define _MDSRCPPS_MDSRCPPS3_LENGTH                          0x1
#define _MDSRCPPS_MDSRCPPS3_MASK                            0x8
#define _MDSRCPPS_MDSRCPPS4_POSN                            0x4
#define _MDSRCPPS_MDSRCPPS4_POSITION                        0x4
#define _MDSRCPPS_MDSRCPPS4_SIZE                            0x1
#define _MDSRCPPS_MDSRCPPS4_LENGTH                          0x1
#define _MDSRCPPS_MDSRCPPS4_MASK                            0x10
#define _MDSRCPPS_MDSRCPPS_POSN                             0x0
#define _MDSRCPPS_MDSRCPPS_POSITION                         0x0
#define _MDSRCPPS_MDSRCPPS_SIZE                             0x5
#define _MDSRCPPS_MDSRCPPS_LENGTH                           0x5
#define _MDSRCPPS_MDSRCPPS_MASK                             0x1F

// Register: RX1PPS
#define RX1PPS RX1PPS
extern volatile unsigned char           RX1PPS              __at(0xEB0);
#ifndef _LIB_BUILD
asm("RX1PPS equ 0EB0h");
#endif
// aliases
extern volatile unsigned char           RXPPS               __at(0xEB0);
#ifndef _LIB_BUILD
asm("RXPPS equ 0EB0h");
#endif
extern volatile unsigned char           RXDT1PPS            __at(0xEB0);
#ifndef _LIB_BUILD
asm("RXDT1PPS equ 0EB0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned RXPPS0                 :1;
        unsigned RXPPS1                 :1;
        unsigned RXPPS2                 :1;
        unsigned RXPPS3                 :1;
        unsigned RXPPS4                 :1;
    };
    struct {
        unsigned RXPPS                  :5;
    };
} RX1PPSbits_t;
extern volatile RX1PPSbits_t RX1PPSbits __at(0xEB0);
// bitfield macros
#define _RX1PPS_PIN_POSN                                    0x0
#define _RX1PPS_PIN_POSITION                                0x0
#define _RX1PPS_PIN_SIZE                                    0x3
#define _RX1PPS_PIN_LENGTH                                  0x3
#define _RX1PPS_PIN_MASK                                    0x7
#define _RX1PPS_PORT_POSN                                   0x3
#define _RX1PPS_PORT_POSITION                               0x3
#define _RX1PPS_PORT_SIZE                                   0x2
#define _RX1PPS_PORT_LENGTH                                 0x2
#define _RX1PPS_PORT_MASK                                   0x18
#define _RX1PPS_RXPPS0_POSN                                 0x0
#define _RX1PPS_RXPPS0_POSITION                             0x0
#define _RX1PPS_RXPPS0_SIZE                                 0x1
#define _RX1PPS_RXPPS0_LENGTH                               0x1
#define _RX1PPS_RXPPS0_MASK                                 0x1
#define _RX1PPS_RXPPS1_POSN                                 0x1
#define _RX1PPS_RXPPS1_POSITION                             0x1
#define _RX1PPS_RXPPS1_SIZE                                 0x1
#define _RX1PPS_RXPPS1_LENGTH                               0x1
#define _RX1PPS_RXPPS1_MASK                                 0x2
#define _RX1PPS_RXPPS2_POSN                                 0x2
#define _RX1PPS_RXPPS2_POSITION                             0x2
#define _RX1PPS_RXPPS2_SIZE                                 0x1
#define _RX1PPS_RXPPS2_LENGTH                               0x1
#define _RX1PPS_RXPPS2_MASK                                 0x4
#define _RX1PPS_RXPPS3_POSN                                 0x3
#define _RX1PPS_RXPPS3_POSITION                             0x3
#define _RX1PPS_RXPPS3_SIZE                                 0x1
#define _RX1PPS_RXPPS3_LENGTH                               0x1
#define _RX1PPS_RXPPS3_MASK                                 0x8
#define _RX1PPS_RXPPS4_POSN                                 0x4
#define _RX1PPS_RXPPS4_POSITION                             0x4
#define _RX1PPS_RXPPS4_SIZE                                 0x1
#define _RX1PPS_RXPPS4_LENGTH                               0x1
#define _RX1PPS_RXPPS4_MASK                                 0x10
#define _RX1PPS_RXPPS_POSN                                  0x0
#define _RX1PPS_RXPPS_POSITION                              0x0
#define _RX1PPS_RXPPS_SIZE                                  0x5
#define _RX1PPS_RXPPS_LENGTH                                0x5
#define _RX1PPS_RXPPS_MASK                                  0x1F
// alias bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned RXPPS0                 :1;
        unsigned RXPPS1                 :1;
        unsigned RXPPS2                 :1;
        unsigned RXPPS3                 :1;
        unsigned RXPPS4                 :1;
    };
    struct {
        unsigned RXPPS                  :5;
    };
} RXPPSbits_t;
extern volatile RXPPSbits_t RXPPSbits __at(0xEB0);
// bitfield macros
#define _RXPPS_PIN_POSN                                     0x0
#define _RXPPS_PIN_POSITION                                 0x0
#define _RXPPS_PIN_SIZE                                     0x3
#define _RXPPS_PIN_LENGTH                                   0x3
#define _RXPPS_PIN_MASK                                     0x7
#define _RXPPS_PORT_POSN                                    0x3
#define _RXPPS_PORT_POSITION                                0x3
#define _RXPPS_PORT_SIZE                                    0x2
#define _RXPPS_PORT_LENGTH                                  0x2
#define _RXPPS_PORT_MASK                                    0x18
#define _RXPPS_RXPPS0_POSN                                  0x0
#define _RXPPS_RXPPS0_POSITION                              0x0
#define _RXPPS_RXPPS0_SIZE                                  0x1
#define _RXPPS_RXPPS0_LENGTH                                0x1
#define _RXPPS_RXPPS0_MASK                                  0x1
#define _RXPPS_RXPPS1_POSN                                  0x1
#define _RXPPS_RXPPS1_POSITION                              0x1
#define _RXPPS_RXPPS1_SIZE                                  0x1
#define _RXPPS_RXPPS1_LENGTH                                0x1
#define _RXPPS_RXPPS1_MASK                                  0x2
#define _RXPPS_RXPPS2_POSN                                  0x2
#define _RXPPS_RXPPS2_POSITION                              0x2
#define _RXPPS_RXPPS2_SIZE                                  0x1
#define _RXPPS_RXPPS2_LENGTH                                0x1
#define _RXPPS_RXPPS2_MASK                                  0x4
#define _RXPPS_RXPPS3_POSN                                  0x3
#define _RXPPS_RXPPS3_POSITION                              0x3
#define _RXPPS_RXPPS3_SIZE                                  0x1
#define _RXPPS_RXPPS3_LENGTH                                0x1
#define _RXPPS_RXPPS3_MASK                                  0x8
#define _RXPPS_RXPPS4_POSN                                  0x4
#define _RXPPS_RXPPS4_POSITION                              0x4
#define _RXPPS_RXPPS4_SIZE                                  0x1
#define _RXPPS_RXPPS4_LENGTH                                0x1
#define _RXPPS_RXPPS4_MASK                                  0x10
#define _RXPPS_RXPPS_POSN                                   0x0
#define _RXPPS_RXPPS_POSITION                               0x0
#define _RXPPS_RXPPS_SIZE                                   0x5
#define _RXPPS_RXPPS_LENGTH                                 0x5
#define _RXPPS_RXPPS_MASK                                   0x1F
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned RXPPS0                 :1;
        unsigned RXPPS1                 :1;
        unsigned RXPPS2                 :1;
        unsigned RXPPS3                 :1;
        unsigned RXPPS4                 :1;
    };
    struct {
        unsigned RXPPS                  :5;
    };
} RXDT1PPSbits_t;
extern volatile RXDT1PPSbits_t RXDT1PPSbits __at(0xEB0);
// bitfield macros
#define _RXDT1PPS_PIN_POSN                                  0x0
#define _RXDT1PPS_PIN_POSITION                              0x0
#define _RXDT1PPS_PIN_SIZE                                  0x3
#define _RXDT1PPS_PIN_LENGTH                                0x3
#define _RXDT1PPS_PIN_MASK                                  0x7
#define _RXDT1PPS_PORT_POSN                                 0x3
#define _RXDT1PPS_PORT_POSITION                             0x3
#define _RXDT1PPS_PORT_SIZE                                 0x2
#define _RXDT1PPS_PORT_LENGTH                               0x2
#define _RXDT1PPS_PORT_MASK                                 0x18
#define _RXDT1PPS_RXPPS0_POSN                               0x0
#define _RXDT1PPS_RXPPS0_POSITION                           0x0
#define _RXDT1PPS_RXPPS0_SIZE                               0x1
#define _RXDT1PPS_RXPPS0_LENGTH                             0x1
#define _RXDT1PPS_RXPPS0_MASK                               0x1
#define _RXDT1PPS_RXPPS1_POSN                               0x1
#define _RXDT1PPS_RXPPS1_POSITION                           0x1
#define _RXDT1PPS_RXPPS1_SIZE                               0x1
#define _RXDT1PPS_RXPPS1_LENGTH                             0x1
#define _RXDT1PPS_RXPPS1_MASK                               0x2
#define _RXDT1PPS_RXPPS2_POSN                               0x2
#define _RXDT1PPS_RXPPS2_POSITION                           0x2
#define _RXDT1PPS_RXPPS2_SIZE                               0x1
#define _RXDT1PPS_RXPPS2_LENGTH                             0x1
#define _RXDT1PPS_RXPPS2_MASK                               0x4
#define _RXDT1PPS_RXPPS3_POSN                               0x3
#define _RXDT1PPS_RXPPS3_POSITION                           0x3
#define _RXDT1PPS_RXPPS3_SIZE                               0x1
#define _RXDT1PPS_RXPPS3_LENGTH                             0x1
#define _RXDT1PPS_RXPPS3_MASK                               0x8
#define _RXDT1PPS_RXPPS4_POSN                               0x4
#define _RXDT1PPS_RXPPS4_POSITION                           0x4
#define _RXDT1PPS_RXPPS4_SIZE                               0x1
#define _RXDT1PPS_RXPPS4_LENGTH                             0x1
#define _RXDT1PPS_RXPPS4_MASK                               0x10
#define _RXDT1PPS_RXPPS_POSN                                0x0
#define _RXDT1PPS_RXPPS_POSITION                            0x0
#define _RXDT1PPS_RXPPS_SIZE                                0x5
#define _RXDT1PPS_RXPPS_LENGTH                              0x5
#define _RXDT1PPS_RXPPS_MASK                                0x1F

