MikroElektronika/core_packages/PIC/XC8/def/PIC18F46Q10/mcu.h
extern volatile __bit                   ADSTPT2             __at(0x7B1A);	// @ (0xF63 * 8 + 2)
#define                                 ADSTPT2_bit         _BIT_ACCESS(ADSTPTL,2)
// ADSTPTL<ADSTPT3>
extern volatile __bit                   ADSTPT3             __at(0x7B1B);	// @ (0xF63 * 8 + 3)
#define                                 ADSTPT3_bit         _BIT_ACCESS(ADSTPTL,3)
// ADSTPTL<ADSTPT4>
extern volatile __bit                   ADSTPT4             __at(0x7B1C);	// @ (0xF63 * 8 + 4)
#define                                 ADSTPT4_bit         _BIT_ACCESS(ADSTPTL,4)
// ADSTPTL<ADSTPT5>
extern volatile __bit                   ADSTPT5             __at(0x7B1D);	// @ (0xF63 * 8 + 5)
#define                                 ADSTPT5_bit         _BIT_ACCESS(ADSTPTL,5)
// ADSTPTL<ADSTPT6>
extern volatile __bit                   ADSTPT6             __at(0x7B1E);	// @ (0xF63 * 8 + 6)
#define                                 ADSTPT6_bit         _BIT_ACCESS(ADSTPTL,6)
// ADSTPTL<ADSTPT7>
extern volatile __bit                   ADSTPT7             __at(0x7B1F);	// @ (0xF63 * 8 + 7)
#define                                 ADSTPT7_bit         _BIT_ACCESS(ADSTPTL,7)
// ADSTPTH<ADSTPT8>
extern volatile __bit                   ADSTPT8             __at(0x7B20);	// @ (0xF64 * 8 + 0)
#define                                 ADSTPT8_bit         _BIT_ACCESS(ADSTPTH,0)
// ADSTPTH<ADSTPT9>
extern volatile __bit                   ADSTPT9             __at(0x7B21);	// @ (0xF64 * 8 + 1)
#define                                 ADSTPT9_bit         _BIT_ACCESS(ADSTPTH,1)
// PIE1<ADTIE>
extern volatile __bit                   ADTIE               __at(0x75F1);	// @ (0xEBE * 8 + 1)
#define                                 ADTIE_bit           _BIT_ACCESS(PIE1,1)
// PIR1<ADTIF>
extern volatile __bit                   ADTIF               __at(0x7631);	// @ (0xEC6 * 8 + 1)
#define                                 ADTIF_bit           _BIT_ACCESS(PIR1,1)
// IPR1<ADTIP>
extern volatile __bit                   ADTIP               __at(0x75B1);	// @ (0xEB6 * 8 + 1)
#define                                 ADTIP_bit           _BIT_ACCESS(IPR1,1)
// ADCON3<ADTMD0>
extern volatile __bit                   ADTMD0              __at(0x7AB0);	// @ (0xF56 * 8 + 0)
#define                                 ADTMD0_bit          _BIT_ACCESS(ADCON3,0)
// ADCON3<ADTMD1>
extern volatile __bit                   ADTMD1              __at(0x7AB1);	// @ (0xF56 * 8 + 1)
#define                                 ADTMD1_bit          _BIT_ACCESS(ADCON3,1)
// ADCON3<ADTMD2>
extern volatile __bit                   ADTMD2              __at(0x7AB2);	// @ (0xF56 * 8 + 2)
#define                                 ADTMD2_bit          _BIT_ACCESS(ADCON3,2)
// ADUTHL<ADUTH0>
extern volatile __bit                   ADUTH0              __at(0x7B38);	// @ (0xF67 * 8 + 0)
#define                                 ADUTH0_bit          _BIT_ACCESS(ADUTHL,0)
// ADUTHL<ADUTH1>
extern volatile __bit                   ADUTH1              __at(0x7B39);	// @ (0xF67 * 8 + 1)
#define                                 ADUTH1_bit          _BIT_ACCESS(ADUTHL,1)
// ADUTHH<ADUTH10>
extern volatile __bit                   ADUTH10             __at(0x7B42);	// @ (0xF68 * 8 + 2)
#define                                 ADUTH10_bit         _BIT_ACCESS(ADUTHH,2)
// ADUTHH<ADUTH11>
extern volatile __bit                   ADUTH11             __at(0x7B43);	// @ (0xF68 * 8 + 3)
#define                                 ADUTH11_bit         _BIT_ACCESS(ADUTHH,3)
// ADUTHH<ADUTH12>
extern volatile __bit                   ADUTH12             __at(0x7B44);	// @ (0xF68 * 8 + 4)
#define                                 ADUTH12_bit         _BIT_ACCESS(ADUTHH,4)
// ADUTHH<ADUTH13>
extern volatile __bit                   ADUTH13             __at(0x7B45);	// @ (0xF68 * 8 + 5)
#define                                 ADUTH13_bit         _BIT_ACCESS(ADUTHH,5)
// ADUTHH<ADUTH14>
extern volatile __bit                   ADUTH14             __at(0x7B46);	// @ (0xF68 * 8 + 6)
#define                                 ADUTH14_bit         _BIT_ACCESS(ADUTHH,6)
// ADUTHH<ADUTH15>
extern volatile __bit                   ADUTH15             __at(0x7B47);	// @ (0xF68 * 8 + 7)
#define                                 ADUTH15_bit         _BIT_ACCESS(ADUTHH,7)
// ADUTHL<ADUTH2>
extern volatile __bit                   ADUTH2              __at(0x7B3A);	// @ (0xF67 * 8 + 2)
#define                                 ADUTH2_bit          _BIT_ACCESS(ADUTHL,2)
// ADUTHL<ADUTH3>
extern volatile __bit                   ADUTH3              __at(0x7B3B);	// @ (0xF67 * 8 + 3)
#define                                 ADUTH3_bit          _BIT_ACCESS(ADUTHL,3)
// ADUTHL<ADUTH4>
extern volatile __bit                   ADUTH4              __at(0x7B3C);	// @ (0xF67 * 8 + 4)
#define                                 ADUTH4_bit          _BIT_ACCESS(ADUTHL,4)
// ADUTHL<ADUTH5>
extern volatile __bit                   ADUTH5              __at(0x7B3D);	// @ (0xF67 * 8 + 5)
#define                                 ADUTH5_bit          _BIT_ACCESS(ADUTHL,5)
// ADUTHL<ADUTH6>
extern volatile __bit                   ADUTH6              __at(0x7B3E);	// @ (0xF67 * 8 + 6)
#define                                 ADUTH6_bit          _BIT_ACCESS(ADUTHL,6)
// ADUTHL<ADUTH7>
extern volatile __bit                   ADUTH7              __at(0x7B3F);	// @ (0xF67 * 8 + 7)
#define                                 ADUTH7_bit          _BIT_ACCESS(ADUTHL,7)
// ADUTHH<ADUTH8>
extern volatile __bit                   ADUTH8              __at(0x7B40);	// @ (0xF68 * 8 + 0)
#define                                 ADUTH8_bit          _BIT_ACCESS(ADUTHH,0)
// ADUTHH<ADUTH9>
extern volatile __bit                   ADUTH9              __at(0x7B41);	// @ (0xF68 * 8 + 1)
#define                                 ADUTH9_bit          _BIT_ACCESS(ADUTHH,1)
// ADSTAT<ADUTHR>
extern volatile __bit                   ADUTHR              __at(0x7B06);	// @ (0xF60 * 8 + 6)
#define                                 ADUTHR_bit          _BIT_ACCESS(ADSTAT,6)
// ANSELA<ANSELA0>
extern volatile __bit                   ANSELA0             __at(0x7860);	// @ (0xF0C * 8 + 0)
#define                                 ANSELA0_bit         _BIT_ACCESS(ANSELA,0)
// ANSELA<ANSELA1>
extern volatile __bit                   ANSELA1             __at(0x7861);	// @ (0xF0C * 8 + 1)
#define                                 ANSELA1_bit         _BIT_ACCESS(ANSELA,1)
// ANSELA<ANSELA2>
extern volatile __bit                   ANSELA2             __at(0x7862);	// @ (0xF0C * 8 + 2)
#define                                 ANSELA2_bit         _BIT_ACCESS(ANSELA,2)
// ANSELA<ANSELA3>
extern volatile __bit                   ANSELA3             __at(0x7863);	// @ (0xF0C * 8 + 3)
#define                                 ANSELA3_bit         _BIT_ACCESS(ANSELA,3)
// ANSELA<ANSELA4>
extern volatile __bit                   ANSELA4             __at(0x7864);	// @ (0xF0C * 8 + 4)
#define                                 ANSELA4_bit         _BIT_ACCESS(ANSELA,4)
// ANSELA<ANSELA5>
extern volatile __bit                   ANSELA5             __at(0x7865);	// @ (0xF0C * 8 + 5)
#define                                 ANSELA5_bit         _BIT_ACCESS(ANSELA,5)
// ANSELA<ANSELA6>
extern volatile __bit                   ANSELA6             __at(0x7866);	// @ (0xF0C * 8 + 6)
#define                                 ANSELA6_bit         _BIT_ACCESS(ANSELA,6)
// ANSELA<ANSELA7>
extern volatile __bit                   ANSELA7             __at(0x7867);	// @ (0xF0C * 8 + 7)
#define                                 ANSELA7_bit         _BIT_ACCESS(ANSELA,7)
// ANSELB<ANSELB0>
extern volatile __bit                   ANSELB0             __at(0x78A0);	// @ (0xF14 * 8 + 0)
#define                                 ANSELB0_bit         _BIT_ACCESS(ANSELB,0)
// ANSELB<ANSELB1>
extern volatile __bit                   ANSELB1             __at(0x78A1);	// @ (0xF14 * 8 + 1)
#define                                 ANSELB1_bit         _BIT_ACCESS(ANSELB,1)
// ANSELB<ANSELB2>
extern volatile __bit                   ANSELB2             __at(0x78A2);	// @ (0xF14 * 8 + 2)
#define                                 ANSELB2_bit         _BIT_ACCESS(ANSELB,2)
// ANSELB<ANSELB3>
extern volatile __bit                   ANSELB3             __at(0x78A3);	// @ (0xF14 * 8 + 3)
#define                                 ANSELB3_bit         _BIT_ACCESS(ANSELB,3)
// ANSELB<ANSELB4>
extern volatile __bit                   ANSELB4             __at(0x78A4);	// @ (0xF14 * 8 + 4)
#define                                 ANSELB4_bit         _BIT_ACCESS(ANSELB,4)
// ANSELB<ANSELB5>
extern volatile __bit                   ANSELB5             __at(0x78A5);	// @ (0xF14 * 8 + 5)
#define                                 ANSELB5_bit         _BIT_ACCESS(ANSELB,5)
// ANSELB<ANSELB6>
extern volatile __bit                   ANSELB6             __at(0x78A6);	// @ (0xF14 * 8 + 6)
#define                                 ANSELB6_bit         _BIT_ACCESS(ANSELB,6)
// ANSELB<ANSELB7>
extern volatile __bit                   ANSELB7             __at(0x78A7);	// @ (0xF14 * 8 + 7)
#define                                 ANSELB7_bit         _BIT_ACCESS(ANSELB,7)
// ANSELC<ANSELC0>
extern volatile __bit                   ANSELC0             __at(0x78E0);	// @ (0xF1C * 8 + 0)
#define                                 ANSELC0_bit         _BIT_ACCESS(ANSELC,0)
// ANSELC<ANSELC1>
extern volatile __bit                   ANSELC1             __at(0x78E1);	// @ (0xF1C * 8 + 1)
#define                                 ANSELC1_bit         _BIT_ACCESS(ANSELC,1)
// ANSELC<ANSELC2>
extern volatile __bit                   ANSELC2             __at(0x78E2);	// @ (0xF1C * 8 + 2)
#define                                 ANSELC2_bit         _BIT_ACCESS(ANSELC,2)
// ANSELC<ANSELC3>
extern volatile __bit                   ANSELC3             __at(0x78E3);	// @ (0xF1C * 8 + 3)
#define                                 ANSELC3_bit         _BIT_ACCESS(ANSELC,3)
// ANSELC<ANSELC4>
extern volatile __bit                   ANSELC4             __at(0x78E4);	// @ (0xF1C * 8 + 4)
#define                                 ANSELC4_bit         _BIT_ACCESS(ANSELC,4)
// ANSELC<ANSELC5>
extern volatile __bit                   ANSELC5             __at(0x78E5);	// @ (0xF1C * 8 + 5)
#define                                 ANSELC5_bit         _BIT_ACCESS(ANSELC,5)
// ANSELC<ANSELC6>
extern volatile __bit                   ANSELC6             __at(0x78E6);	// @ (0xF1C * 8 + 6)
#define                                 ANSELC6_bit         _BIT_ACCESS(ANSELC,6)
// ANSELC<ANSELC7>
extern volatile __bit                   ANSELC7             __at(0x78E7);	// @ (0xF1C * 8 + 7)
#define                                 ANSELC7_bit         _BIT_ACCESS(ANSELC,7)
// ANSELD<ANSELD0>
extern volatile __bit                   ANSELD0             __at(0x7908);	// @ (0xF21 * 8 + 0)
#define                                 ANSELD0_bit         _BIT_ACCESS(ANSELD,0)
// ANSELD<ANSELD1>
extern volatile __bit                   ANSELD1             __at(0x7909);	// @ (0xF21 * 8 + 1)
#define                                 ANSELD1_bit         _BIT_ACCESS(ANSELD,1)
// ANSELD<ANSELD2>
extern volatile __bit                   ANSELD2             __at(0x790A);	// @ (0xF21 * 8 + 2)
#define                                 ANSELD2_bit         _BIT_ACCESS(ANSELD,2)
// ANSELD<ANSELD3>
extern volatile __bit                   ANSELD3             __at(0x790B);	// @ (0xF21 * 8 + 3)
#define                                 ANSELD3_bit         _BIT_ACCESS(ANSELD,3)
// ANSELD<ANSELD4>
extern volatile __bit                   ANSELD4             __at(0x790C);	// @ (0xF21 * 8 + 4)
#define                                 ANSELD4_bit         _BIT_ACCESS(ANSELD,4)
// ANSELD<ANSELD5>
extern volatile __bit                   ANSELD5             __at(0x790D);	// @ (0xF21 * 8 + 5)
#define                                 ANSELD5_bit         _BIT_ACCESS(ANSELD,5)
// ANSELD<ANSELD6>
extern volatile __bit                   ANSELD6             __at(0x790E);	// @ (0xF21 * 8 + 6)
#define                                 ANSELD6_bit         _BIT_ACCESS(ANSELD,6)
// ANSELD<ANSELD7>
extern volatile __bit                   ANSELD7             __at(0x790F);	// @ (0xF21 * 8 + 7)
#define                                 ANSELD7_bit         _BIT_ACCESS(ANSELD,7)
// ANSELE<ANSELE0>
extern volatile __bit                   ANSELE0             __at(0x7948);	// @ (0xF29 * 8 + 0)
#define                                 ANSELE0_bit         _BIT_ACCESS(ANSELE,0)
// ANSELE<ANSELE1>
extern volatile __bit                   ANSELE1             __at(0x7949);	// @ (0xF29 * 8 + 1)
#define                                 ANSELE1_bit         _BIT_ACCESS(ANSELE,1)
// ANSELE<ANSELE2>
extern volatile __bit                   ANSELE2             __at(0x794A);	// @ (0xF29 * 8 + 2)
#define                                 ANSELE2_bit         _BIT_ACCESS(ANSELE,2)
// CWG1AS1<AS0E>
extern volatile __bit                   AS0E                __at(0x7A10);	// @ (0xF42 * 8 + 0)
#define                                 AS0E_bit            _BIT_ACCESS(CWG1AS1,0)
// CWG1AS1<AS1E>
extern volatile __bit                   AS1E                __at(0x7A11);	// @ (0xF42 * 8 + 1)
#define                                 AS1E_bit            _BIT_ACCESS(CWG1AS1,1)
// CWG1AS1<AS2E>
extern volatile __bit                   AS2E                __at(0x7A12);	// @ (0xF42 * 8 + 2)
#define                                 AS2E_bit            _BIT_ACCESS(CWG1AS1,2)
// CWG1AS1<AS3E>
extern volatile __bit                   AS3E                __at(0x7A13);	// @ (0xF42 * 8 + 3)
#define                                 AS3E_bit            _BIT_ACCESS(CWG1AS1,3)
// CWG1AS1<AS4E>
extern volatile __bit                   AS4E                __at(0x7A14);	// @ (0xF42 * 8 + 4)
#define                                 AS4E_bit            _BIT_ACCESS(CWG1AS1,4)
// CWG1AS1<AS5E>
extern volatile __bit                   AS5E                __at(0x7A15);	// @ (0xF42 * 8 + 5)
#define                                 AS5E_bit            _BIT_ACCESS(CWG1AS1,5)
// PIE3<BCL1IE>
extern volatile __bit                   BCL1IE              __at(0x7601);	// @ (0xEC0 * 8 + 1)
#define                                 BCL1IE_bit          _BIT_ACCESS(PIE3,1)
// PIR3<BCL1IF>
extern volatile __bit                   BCL1IF              __at(0x7641);	// @ (0xEC8 * 8 + 1)
#define                                 BCL1IF_bit          _BIT_ACCESS(PIR3,1)
// IPR3<BCL1IP>
extern volatile __bit                   BCL1IP              __at(0x75C1);	// @ (0xEB8 * 8 + 1)
#define                                 BCL1IP_bit          _BIT_ACCESS(IPR3,1)
// PIE3<BCL2IE>
extern volatile __bit                   BCL2IE              __at(0x7603);	// @ (0xEC0 * 8 + 3)
#define                                 BCL2IE_bit          _BIT_ACCESS(PIE3,3)
// PIR3<BCL2IF>
extern volatile __bit                   BCL2IF              __at(0x7643);	// @ (0xEC8 * 8 + 3)
#define                                 BCL2IF_bit          _BIT_ACCESS(PIR3,3)
// IPR3<BCL2IP>
extern volatile __bit                   BCL2IP              __at(0x75C3);	// @ (0xEB8 * 8 + 3)
#define                                 BCL2IP_bit          _BIT_ACCESS(IPR3,3)
// PIE3<BCLIE>
extern volatile __bit                   BCLIE               __at(0x7601);	// @ (0xEC0 * 8 + 1)
#define                                 BCLIE_bit           _BIT_ACCESS(PIE3,1)
// PIR3<BCLIF>
extern volatile __bit                   BCLIF               __at(0x7641);	// @ (0xEC8 * 8 + 1)
#define                                 BCLIF_bit           _BIT_ACCESS(PIR3,1)
// IPR3<BCLIP>
extern volatile __bit                   BCLIP               __at(0x75C1);	// @ (0xEB8 * 8 + 1)
#define                                 BCLIP_bit           _BIT_ACCESS(IPR3,1)
// SSP1STAT<BF1>
extern volatile __bit                   BF1                 __at(0x7CA0);	// @ (0xF94 * 8 + 0)
#define                                 BF1_bit             _BIT_ACCESS(SSP1STAT,0)
// SSP2STAT<BF2>
extern volatile __bit                   BF2                 __at(0x7480);	// @ (0xE90 * 8 + 0)
#define                                 BF2_bit             _BIT_ACCESS(SSP2STAT,0)
// MDCON0<BIT>
extern volatile __bit                   BIT                 __at(0x7A60);	// @ (0xF4C * 8 + 0)
#define                                 BIT_bit             _BIT_ACCESS(MDCON0,0)
// PCON0<BOR>
extern volatile __bit                   BOR                 __at(0x7EB8);	// @ (0xFD7 * 8 + 0)
#define                                 BOR_bit             _BIT_ACCESS(PCON0,0)
// BORCON<BORRDY>
extern volatile __bit                   BORRDY              __at(0x76D8);	// @ (0xEDB * 8 + 0)
#define                                 BORRDY_bit          _BIT_ACCESS(BORCON,0)
// CM1CON0<C1EN>
extern volatile __bit                   C1EN                __at(0x79A7);	// @ (0xF34 * 8 + 7)
#define                                 C1EN_bit            _BIT_ACCESS(CM1CON0,7)
// CM1CON0<C1HYS>
extern volatile __bit                   C1HYS               __at(0x79A1);	// @ (0xF34 * 8 + 1)
#define                                 C1HYS_bit           _BIT_ACCESS(CM1CON0,1)
// PIE2<C1IE>
extern volatile __bit                   C1IE                __at(0x75F8);	// @ (0xEBF * 8 + 0)
#define                                 C1IE_bit            _BIT_ACCESS(PIE2,0)
// PIR2<C1IF>
extern volatile __bit                   C1IF                __at(0x7638);	// @ (0xEC7 * 8 + 0)
#define                                 C1IF_bit            _BIT_ACCESS(PIR2,0)
// CM1CON1<C1INTN>
extern volatile __bit                   C1INTN              __at(0x79A8);	// @ (0xF35 * 8 + 0)
#define                                 C1INTN_bit          _BIT_ACCESS(CM1CON1,0)
// CM1CON1<C1INTP>
extern volatile __bit                   C1INTP              __at(0x79A9);	// @ (0xF35 * 8 + 1)
#define                                 C1INTP_bit          _BIT_ACCESS(CM1CON1,1)
// IPR2<C1IP>
extern volatile __bit                   C1IP                __at(0x75B8);	// @ (0xEB7 * 8 + 0)
#define                                 C1IP_bit            _BIT_ACCESS(IPR2,0)
// CM1NCH<C1NCH0>
extern volatile __bit                   C1NCH0              __at(0x79B0);	// @ (0xF36 * 8 + 0)
#define                                 C1NCH0_bit          _BIT_ACCESS(CM1NCH,0)
// CM1NCH<C1NCH1>
extern volatile __bit                   C1NCH1              __at(0x79B1);	// @ (0xF36 * 8 + 1)
#define                                 C1NCH1_bit          _BIT_ACCESS(CM1NCH,1)
// CM1NCH<C1NCH2>
extern volatile __bit                   C1NCH2              __at(0x79B2);	// @ (0xF36 * 8 + 2)
#define                                 C1NCH2_bit          _BIT_ACCESS(CM1NCH,2)
// CM1CON0<C1OUT>
extern volatile __bit                   C1OUT               __at(0x79A6);	// @ (0xF34 * 8 + 6)
#define                                 C1OUT_bit           _BIT_ACCESS(CM1CON0,6)
// CM1PCH<C1PCH0>
extern volatile __bit                   C1PCH0              __at(0x79B8);	// @ (0xF37 * 8 + 0)
#define                                 C1PCH0_bit          _BIT_ACCESS(CM1PCH,0)
// CM1PCH<C1PCH1>
extern volatile __bit                   C1PCH1              __at(0x79B9);	// @ (0xF37 * 8 + 1)
#define                                 C1PCH1_bit          _BIT_ACCESS(CM1PCH,1)
// CM1PCH<C1PCH2>
extern volatile __bit                   C1PCH2              __at(0x79BA);	// @ (0xF37 * 8 + 2)
#define                                 C1PCH2_bit          _BIT_ACCESS(CM1PCH,2)
// CM1CON0<C1POL>
extern volatile __bit                   C1POL               __at(0x79A4);	// @ (0xF34 * 8 + 4)
#define                                 C1POL_bit           _BIT_ACCESS(CM1CON0,4)
// CM1CON0<C1SYNC>
extern volatile __bit                   C1SYNC              __at(0x79A0);	// @ (0xF34 * 8 + 0)
#define                                 C1SYNC_bit          _BIT_ACCESS(CM1CON0,0)
// CCPTMRS<C1TSEL0>
extern volatile __bit                   C1TSEL0             __at(0x7D68);	// @ (0xFAD * 8 + 0)
#define                                 C1TSEL0_bit         _BIT_ACCESS(CCPTMRS,0)
// CCPTMRS<C1TSEL1>
extern volatile __bit                   C1TSEL1             __at(0x7D69);	// @ (0xFAD * 8 + 1)
#define                                 C1TSEL1_bit         _BIT_ACCESS(CCPTMRS,1)
// CM2CON0<C2EN>
extern volatile __bit                   C2EN                __at(0x7987);	// @ (0xF30 * 8 + 7)
#define                                 C2EN_bit            _BIT_ACCESS(CM2CON0,7)
// CM2CON0<C2HYS>
extern volatile __bit                   C2HYS               __at(0x7981);	// @ (0xF30 * 8 + 1)
#define                                 C2HYS_bit           _BIT_ACCESS(CM2CON0,1)
// PIE2<C2IE>
extern volatile __bit                   C2IE                __at(0x75F9);	// @ (0xEBF * 8 + 1)
#define                                 C2IE_bit            _BIT_ACCESS(PIE2,1)
// PIR2<C2IF>
extern volatile __bit                   C2IF                __at(0x7639);	// @ (0xEC7 * 8 + 1)
#define                                 C2IF_bit            _BIT_ACCESS(PIR2,1)
// CM2CON1<C2INTN>
extern volatile __bit                   C2INTN              __at(0x7988);	// @ (0xF31 * 8 + 0)
#define                                 C2INTN_bit          _BIT_ACCESS(CM2CON1,0)
// CM2CON1<C2INTP>
extern volatile __bit                   C2INTP              __at(0x7989);	// @ (0xF31 * 8 + 1)
#define                                 C2INTP_bit          _BIT_ACCESS(CM2CON1,1)
// IPR2<C2IP>
extern volatile __bit                   C2IP                __at(0x75B9);	// @ (0xEB7 * 8 + 1)
#define                                 C2IP_bit            _BIT_ACCESS(IPR2,1)
// CM2NCH<C2NCH0>
extern volatile __bit                   C2NCH0              __at(0x7990);	// @ (0xF32 * 8 + 0)
#define                                 C2NCH0_bit          _BIT_ACCESS(CM2NCH,0)
// CM2NCH<C2NCH1>
extern volatile __bit                   C2NCH1              __at(0x7991);	// @ (0xF32 * 8 + 1)
#define                                 C2NCH1_bit          _BIT_ACCESS(CM2NCH,1)
// CM2NCH<C2NCH2>
extern volatile __bit                   C2NCH2              __at(0x7992);	// @ (0xF32 * 8 + 2)
#define                                 C2NCH2_bit          _BIT_ACCESS(CM2NCH,2)
// CM2CON0<C2OUT>
extern volatile __bit                   C2OUT               __at(0x7986);	// @ (0xF30 * 8 + 6)
#define                                 C2OUT_bit           _BIT_ACCESS(CM2CON0,6)
// CM2PCH<C2PCH0>
extern volatile __bit                   C2PCH0              __at(0x7998);	// @ (0xF33 * 8 + 0)
#define                                 C2PCH0_bit          _BIT_ACCESS(CM2PCH,0)
// CM2PCH<C2PCH1>
extern volatile __bit                   C2PCH1              __at(0x7999);	// @ (0xF33 * 8 + 1)
#define                                 C2PCH1_bit          _BIT_ACCESS(CM2PCH,1)
// CM2PCH<C2PCH2>
extern volatile __bit                   C2PCH2              __at(0x799A);	// @ (0xF33 * 8 + 2)
#define                                 C2PCH2_bit          _BIT_ACCESS(CM2PCH,2)
// CM2CON0<C2POL>
extern volatile __bit                   C2POL               __at(0x7984);	// @ (0xF30 * 8 + 4)
#define                                 C2POL_bit           _BIT_ACCESS(CM2CON0,4)
// CM2CON0<C2SYNC>
extern volatile __bit                   C2SYNC              __at(0x7980);	// @ (0xF30 * 8 + 0)
#define                                 C2SYNC_bit          _BIT_ACCESS(CM2CON0,0)
// CCPTMRS<C2TSEL0>
extern volatile __bit                   C2TSEL0             __at(0x7D6A);	// @ (0xFAD * 8 + 2)
#define                                 C2TSEL0_bit         _BIT_ACCESS(CCPTMRS,2)
// CCPTMRS<C2TSEL1>
extern volatile __bit                   C2TSEL1             __at(0x7D6B);	// @ (0xFAD * 8 + 3)
#define                                 C2TSEL1_bit         _BIT_ACCESS(CCPTMRS,3)
// CCP1CAP<CCP1CTS0>
extern volatile __bit                   CCP1CTS0            __at(0x7D60);	// @ (0xFAC * 8 + 0)
#define                                 CCP1CTS0_bit        _BIT_ACCESS(CCP1CAP,0)
// CCP1CAP<CCP1CTS1>
