MikroElektronika/core_packages/PIC/XC8/def/PIC18F46Q10/mcu.h
extern volatile __bit                   RC7PPS1             __at(0x77C9);	// @ (0xEF9 * 8 + 1)
#define                                 RC7PPS1_bit         _BIT_ACCESS(RC7PPS,1)
// RC7PPS<RC7PPS2>
extern volatile __bit                   RC7PPS2             __at(0x77CA);	// @ (0xEF9 * 8 + 2)
#define                                 RC7PPS2_bit         _BIT_ACCESS(RC7PPS,2)
// RC7PPS<RC7PPS3>
extern volatile __bit                   RC7PPS3             __at(0x77CB);	// @ (0xEF9 * 8 + 3)
#define                                 RC7PPS3_bit         _BIT_ACCESS(RC7PPS,3)
// RC7PPS<RC7PPS4>
extern volatile __bit                   RC7PPS4             __at(0x77CC);	// @ (0xEF9 * 8 + 4)
#define                                 RC7PPS4_bit         _BIT_ACCESS(RC7PPS,4)
// SSP1CON2<RCEN1>
extern volatile __bit                   RCEN1               __at(0x7CB3);	// @ (0xF96 * 8 + 3)
#define                                 RCEN1_bit           _BIT_ACCESS(SSP1CON2,3)
// SSP2CON2<RCEN2>
extern volatile __bit                   RCEN2               __at(0x7493);	// @ (0xE92 * 8 + 3)
#define                                 RCEN2_bit           _BIT_ACCESS(SSP2CON2,3)
// PIE3<RCIE>
extern volatile __bit                   RCIE                __at(0x7605);	// @ (0xEC0 * 8 + 5)
#define                                 RCIE_bit            _BIT_ACCESS(PIE3,5)
// PIR3<RCIF>
extern volatile __bit                   RCIF                __at(0x7645);	// @ (0xEC8 * 8 + 5)
#define                                 RCIF_bit            _BIT_ACCESS(PIR3,5)
// IPR3<RCIP>
extern volatile __bit                   RCIP                __at(0x75C5);	// @ (0xEB8 * 8 + 5)
#define                                 RCIP_bit            _BIT_ACCESS(IPR3,5)
// PCON1<RCM>
extern volatile __bit                   RCM                 __at(0x7EB0);	// @ (0xFD6 * 8 + 0)
#define                                 RCM_bit             _BIT_ACCESS(PCON1,0)
// NVMCON1<RD>
extern volatile __bit                   RD                  __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 RD_bit              _BIT_ACCESS(NVMCON1,0)
// PORTD<RD0>
extern volatile __bit                   RD0                 __at(0x7C78);	// @ (0xF8F * 8 + 0)
#define                                 RD0_bit             _BIT_ACCESS(PORTD,0)
// RD0PPS<RD0PPS0>
extern volatile __bit                   RD0PPS0             __at(0x77D0);	// @ (0xEFA * 8 + 0)
#define                                 RD0PPS0_bit         _BIT_ACCESS(RD0PPS,0)
// RD0PPS<RD0PPS1>
extern volatile __bit                   RD0PPS1             __at(0x77D1);	// @ (0xEFA * 8 + 1)
#define                                 RD0PPS1_bit         _BIT_ACCESS(RD0PPS,1)
// RD0PPS<RD0PPS2>
extern volatile __bit                   RD0PPS2             __at(0x77D2);	// @ (0xEFA * 8 + 2)
#define                                 RD0PPS2_bit         _BIT_ACCESS(RD0PPS,2)
// RD0PPS<RD0PPS3>
extern volatile __bit                   RD0PPS3             __at(0x77D3);	// @ (0xEFA * 8 + 3)
#define                                 RD0PPS3_bit         _BIT_ACCESS(RD0PPS,3)
// RD0PPS<RD0PPS4>
extern volatile __bit                   RD0PPS4             __at(0x77D4);	// @ (0xEFA * 8 + 4)
#define                                 RD0PPS4_bit         _BIT_ACCESS(RD0PPS,4)
// PORTD<RD1>
extern volatile __bit                   RD1                 __at(0x7C79);	// @ (0xF8F * 8 + 1)
#define                                 RD1_bit             _BIT_ACCESS(PORTD,1)
// T1CON<RD161>
extern volatile __bit                   RD161               __at(0x7E71);	// @ (0xFCE * 8 + 1)
#define                                 RD161_bit           _BIT_ACCESS(T1CON,1)
// T3CON<RD163>
extern volatile __bit                   RD163               __at(0x7E41);	// @ (0xFC8 * 8 + 1)
#define                                 RD163_bit           _BIT_ACCESS(T3CON,1)
// T5CON<RD165>
extern volatile __bit                   RD165               __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 RD165_bit           _BIT_ACCESS(T5CON,1)
// RD1PPS<RD1PPS0>
extern volatile __bit                   RD1PPS0             __at(0x77D8);	// @ (0xEFB * 8 + 0)
#define                                 RD1PPS0_bit         _BIT_ACCESS(RD1PPS,0)
// RD1PPS<RD1PPS1>
extern volatile __bit                   RD1PPS1             __at(0x77D9);	// @ (0xEFB * 8 + 1)
#define                                 RD1PPS1_bit         _BIT_ACCESS(RD1PPS,1)
// RD1PPS<RD1PPS2>
extern volatile __bit                   RD1PPS2             __at(0x77DA);	// @ (0xEFB * 8 + 2)
#define                                 RD1PPS2_bit         _BIT_ACCESS(RD1PPS,2)
// RD1PPS<RD1PPS3>
extern volatile __bit                   RD1PPS3             __at(0x77DB);	// @ (0xEFB * 8 + 3)
#define                                 RD1PPS3_bit         _BIT_ACCESS(RD1PPS,3)
// RD1PPS<RD1PPS4>
extern volatile __bit                   RD1PPS4             __at(0x77DC);	// @ (0xEFB * 8 + 4)
#define                                 RD1PPS4_bit         _BIT_ACCESS(RD1PPS,4)
// PORTD<RD2>
extern volatile __bit                   RD2                 __at(0x7C7A);	// @ (0xF8F * 8 + 2)
#define                                 RD2_bit             _BIT_ACCESS(PORTD,2)
// RD2PPS<RD2PPS0>
extern volatile __bit                   RD2PPS0             __at(0x77E0);	// @ (0xEFC * 8 + 0)
#define                                 RD2PPS0_bit         _BIT_ACCESS(RD2PPS,0)
// RD2PPS<RD2PPS1>
extern volatile __bit                   RD2PPS1             __at(0x77E1);	// @ (0xEFC * 8 + 1)
#define                                 RD2PPS1_bit         _BIT_ACCESS(RD2PPS,1)
// RD2PPS<RD2PPS2>
extern volatile __bit                   RD2PPS2             __at(0x77E2);	// @ (0xEFC * 8 + 2)
#define                                 RD2PPS2_bit         _BIT_ACCESS(RD2PPS,2)
// RD2PPS<RD2PPS3>
extern volatile __bit                   RD2PPS3             __at(0x77E3);	// @ (0xEFC * 8 + 3)
#define                                 RD2PPS3_bit         _BIT_ACCESS(RD2PPS,3)
// RD2PPS<RD2PPS4>
extern volatile __bit                   RD2PPS4             __at(0x77E4);	// @ (0xEFC * 8 + 4)
#define                                 RD2PPS4_bit         _BIT_ACCESS(RD2PPS,4)
// PORTD<RD3>
extern volatile __bit                   RD3                 __at(0x7C7B);	// @ (0xF8F * 8 + 3)
#define                                 RD3_bit             _BIT_ACCESS(PORTD,3)
// RD3PPS<RD3PPS0>
extern volatile __bit                   RD3PPS0             __at(0x77E8);	// @ (0xEFD * 8 + 0)
#define                                 RD3PPS0_bit         _BIT_ACCESS(RD3PPS,0)
// RD3PPS<RD3PPS1>
extern volatile __bit                   RD3PPS1             __at(0x77E9);	// @ (0xEFD * 8 + 1)
#define                                 RD3PPS1_bit         _BIT_ACCESS(RD3PPS,1)
// RD3PPS<RD3PPS2>
extern volatile __bit                   RD3PPS2             __at(0x77EA);	// @ (0xEFD * 8 + 2)
#define                                 RD3PPS2_bit         _BIT_ACCESS(RD3PPS,2)
// RD3PPS<RD3PPS3>
extern volatile __bit                   RD3PPS3             __at(0x77EB);	// @ (0xEFD * 8 + 3)
#define                                 RD3PPS3_bit         _BIT_ACCESS(RD3PPS,3)
// RD3PPS<RD3PPS4>
extern volatile __bit                   RD3PPS4             __at(0x77EC);	// @ (0xEFD * 8 + 4)
#define                                 RD3PPS4_bit         _BIT_ACCESS(RD3PPS,4)
// PORTD<RD4>
extern volatile __bit                   RD4                 __at(0x7C7C);	// @ (0xF8F * 8 + 4)
#define                                 RD4_bit             _BIT_ACCESS(PORTD,4)
// RD4PPS<RD4PPS0>
extern volatile __bit                   RD4PPS0             __at(0x77F0);	// @ (0xEFE * 8 + 0)
#define                                 RD4PPS0_bit         _BIT_ACCESS(RD4PPS,0)
// RD4PPS<RD4PPS1>
extern volatile __bit                   RD4PPS1             __at(0x77F1);	// @ (0xEFE * 8 + 1)
#define                                 RD4PPS1_bit         _BIT_ACCESS(RD4PPS,1)
// RD4PPS<RD4PPS2>
extern volatile __bit                   RD4PPS2             __at(0x77F2);	// @ (0xEFE * 8 + 2)
#define                                 RD4PPS2_bit         _BIT_ACCESS(RD4PPS,2)
// RD4PPS<RD4PPS3>
extern volatile __bit                   RD4PPS3             __at(0x77F3);	// @ (0xEFE * 8 + 3)
#define                                 RD4PPS3_bit         _BIT_ACCESS(RD4PPS,3)
// RD4PPS<RD4PPS4>
extern volatile __bit                   RD4PPS4             __at(0x77F4);	// @ (0xEFE * 8 + 4)
#define                                 RD4PPS4_bit         _BIT_ACCESS(RD4PPS,4)
// PORTD<RD5>
extern volatile __bit                   RD5                 __at(0x7C7D);	// @ (0xF8F * 8 + 5)
#define                                 RD5_bit             _BIT_ACCESS(PORTD,5)
// RD5PPS<RD5PPS0>
extern volatile __bit                   RD5PPS0             __at(0x77F8);	// @ (0xEFF * 8 + 0)
#define                                 RD5PPS0_bit         _BIT_ACCESS(RD5PPS,0)
// RD5PPS<RD5PPS1>
extern volatile __bit                   RD5PPS1             __at(0x77F9);	// @ (0xEFF * 8 + 1)
#define                                 RD5PPS1_bit         _BIT_ACCESS(RD5PPS,1)
// RD5PPS<RD5PPS2>
extern volatile __bit                   RD5PPS2             __at(0x77FA);	// @ (0xEFF * 8 + 2)
#define                                 RD5PPS2_bit         _BIT_ACCESS(RD5PPS,2)
// RD5PPS<RD5PPS3>
extern volatile __bit                   RD5PPS3             __at(0x77FB);	// @ (0xEFF * 8 + 3)
#define                                 RD5PPS3_bit         _BIT_ACCESS(RD5PPS,3)
// RD5PPS<RD5PPS4>
extern volatile __bit                   RD5PPS4             __at(0x77FC);	// @ (0xEFF * 8 + 4)
#define                                 RD5PPS4_bit         _BIT_ACCESS(RD5PPS,4)
// PORTD<RD6>
extern volatile __bit                   RD6                 __at(0x7C7E);	// @ (0xF8F * 8 + 6)
#define                                 RD6_bit             _BIT_ACCESS(PORTD,6)
// RD6PPS<RD6PPS0>
extern volatile __bit                   RD6PPS0             __at(0x7800);	// @ (0xF00 * 8 + 0)
#define                                 RD6PPS0_bit         _BIT_ACCESS(RD6PPS,0)
// RD6PPS<RD6PPS1>
extern volatile __bit                   RD6PPS1             __at(0x7801);	// @ (0xF00 * 8 + 1)
#define                                 RD6PPS1_bit         _BIT_ACCESS(RD6PPS,1)
// RD6PPS<RD6PPS2>
extern volatile __bit                   RD6PPS2             __at(0x7802);	// @ (0xF00 * 8 + 2)
#define                                 RD6PPS2_bit         _BIT_ACCESS(RD6PPS,2)
// RD6PPS<RD6PPS3>
extern volatile __bit                   RD6PPS3             __at(0x7803);	// @ (0xF00 * 8 + 3)
#define                                 RD6PPS3_bit         _BIT_ACCESS(RD6PPS,3)
// RD6PPS<RD6PPS4>
extern volatile __bit                   RD6PPS4             __at(0x7804);	// @ (0xF00 * 8 + 4)
#define                                 RD6PPS4_bit         _BIT_ACCESS(RD6PPS,4)
// PORTD<RD7>
extern volatile __bit                   RD7                 __at(0x7C7F);	// @ (0xF8F * 8 + 7)
#define                                 RD7_bit             _BIT_ACCESS(PORTD,7)
// RD7PPS<RD7PPS0>
extern volatile __bit                   RD7PPS0             __at(0x7808);	// @ (0xF01 * 8 + 0)
#define                                 RD7PPS0_bit         _BIT_ACCESS(RD7PPS,0)
// RD7PPS<RD7PPS1>
extern volatile __bit                   RD7PPS1             __at(0x7809);	// @ (0xF01 * 8 + 1)
#define                                 RD7PPS1_bit         _BIT_ACCESS(RD7PPS,1)
// RD7PPS<RD7PPS2>
extern volatile __bit                   RD7PPS2             __at(0x780A);	// @ (0xF01 * 8 + 2)
#define                                 RD7PPS2_bit         _BIT_ACCESS(RD7PPS,2)
// RD7PPS<RD7PPS3>
extern volatile __bit                   RD7PPS3             __at(0x780B);	// @ (0xF01 * 8 + 3)
#define                                 RD7PPS3_bit         _BIT_ACCESS(RD7PPS,3)
// RD7PPS<RD7PPS4>
extern volatile __bit                   RD7PPS4             __at(0x780C);	// @ (0xF01 * 8 + 4)
#define                                 RD7PPS4_bit         _BIT_ACCESS(RD7PPS,4)
// PORTE<RE0>
extern volatile __bit                   RE0                 __at(0x7C80);	// @ (0xF90 * 8 + 0)
#define                                 RE0_bit             _BIT_ACCESS(PORTE,0)
// RE0PPS<RE0PPS0>
extern volatile __bit                   RE0PPS0             __at(0x7810);	// @ (0xF02 * 8 + 0)
#define                                 RE0PPS0_bit         _BIT_ACCESS(RE0PPS,0)
// RE0PPS<RE0PPS1>
extern volatile __bit                   RE0PPS1             __at(0x7811);	// @ (0xF02 * 8 + 1)
#define                                 RE0PPS1_bit         _BIT_ACCESS(RE0PPS,1)
// RE0PPS<RE0PPS2>
extern volatile __bit                   RE0PPS2             __at(0x7812);	// @ (0xF02 * 8 + 2)
#define                                 RE0PPS2_bit         _BIT_ACCESS(RE0PPS,2)
// RE0PPS<RE0PPS3>
extern volatile __bit                   RE0PPS3             __at(0x7813);	// @ (0xF02 * 8 + 3)
#define                                 RE0PPS3_bit         _BIT_ACCESS(RE0PPS,3)
// RE0PPS<RE0PPS4>
extern volatile __bit                   RE0PPS4             __at(0x7814);	// @ (0xF02 * 8 + 4)
#define                                 RE0PPS4_bit         _BIT_ACCESS(RE0PPS,4)
// PORTE<RE1>
extern volatile __bit                   RE1                 __at(0x7C81);	// @ (0xF90 * 8 + 1)
#define                                 RE1_bit             _BIT_ACCESS(PORTE,1)
// RE1PPS<RE1PPS0>
extern volatile __bit                   RE1PPS0             __at(0x7818);	// @ (0xF03 * 8 + 0)
#define                                 RE1PPS0_bit         _BIT_ACCESS(RE1PPS,0)
// RE1PPS<RE1PPS1>
extern volatile __bit                   RE1PPS1             __at(0x7819);	// @ (0xF03 * 8 + 1)
#define                                 RE1PPS1_bit         _BIT_ACCESS(RE1PPS,1)
// RE1PPS<RE1PPS2>
extern volatile __bit                   RE1PPS2             __at(0x781A);	// @ (0xF03 * 8 + 2)
#define                                 RE1PPS2_bit         _BIT_ACCESS(RE1PPS,2)
// RE1PPS<RE1PPS3>
extern volatile __bit                   RE1PPS3             __at(0x781B);	// @ (0xF03 * 8 + 3)
#define                                 RE1PPS3_bit         _BIT_ACCESS(RE1PPS,3)
// RE1PPS<RE1PPS4>
extern volatile __bit                   RE1PPS4             __at(0x781C);	// @ (0xF03 * 8 + 4)
#define                                 RE1PPS4_bit         _BIT_ACCESS(RE1PPS,4)
// PORTE<RE2>
extern volatile __bit                   RE2                 __at(0x7C82);	// @ (0xF90 * 8 + 2)
#define                                 RE2_bit             _BIT_ACCESS(PORTE,2)
// RE2PPS<RE2PPS0>
extern volatile __bit                   RE2PPS0             __at(0x7820);	// @ (0xF04 * 8 + 0)
#define                                 RE2PPS0_bit         _BIT_ACCESS(RE2PPS,0)
// RE2PPS<RE2PPS1>
extern volatile __bit                   RE2PPS1             __at(0x7821);	// @ (0xF04 * 8 + 1)
#define                                 RE2PPS1_bit         _BIT_ACCESS(RE2PPS,1)
// RE2PPS<RE2PPS2>
extern volatile __bit                   RE2PPS2             __at(0x7822);	// @ (0xF04 * 8 + 2)
#define                                 RE2PPS2_bit         _BIT_ACCESS(RE2PPS,2)
// RE2PPS<RE2PPS3>
extern volatile __bit                   RE2PPS3             __at(0x7823);	// @ (0xF04 * 8 + 3)
#define                                 RE2PPS3_bit         _BIT_ACCESS(RE2PPS,3)
// RE2PPS<RE2PPS4>
extern volatile __bit                   RE2PPS4             __at(0x7824);	// @ (0xF04 * 8 + 4)
#define                                 RE2PPS4_bit         _BIT_ACCESS(RE2PPS,4)
// PORTE<RE3>
extern volatile __bit                   RE3                 __at(0x7C83);	// @ (0xF90 * 8 + 3)
#define                                 RE3_bit             _BIT_ACCESS(PORTE,3)
// SSP1STAT<READ_WRITE1>
extern volatile __bit                   READ_WRITE1         __at(0x7CA2);	// @ (0xF94 * 8 + 2)
#define                                 READ_WRITE1_bit     _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<READ_WRITE2>
extern volatile __bit                   READ_WRITE2         __at(0x7482);	// @ (0xE90 * 8 + 2)
#define                                 READ_WRITE2_bit     _BIT_ACCESS(SSP2STAT,2)
// CWG1AS0<REN>
extern volatile __bit                   REN                 __at(0x7A0E);	// @ (0xF41 * 8 + 6)
#define                                 REN_bit             _BIT_ACCESS(CWG1AS0,6)
// PCON0<RI>
extern volatile __bit                   RI                  __at(0x7EBA);	// @ (0xFD7 * 8 + 2)
#define                                 RI_bit              _BIT_ACCESS(PCON0,2)
// PCON0<RMCLR>
extern volatile __bit                   RMCLR               __at(0x7EBB);	// @ (0xFD7 * 8 + 3)
#define                                 RMCLR_bit           _BIT_ACCESS(PCON0,3)
// CPUDOZE<ROI>
extern volatile __bit                   ROI                 __at(0x7695);	// @ (0xED2 * 8 + 5)
#define                                 ROI_bit             _BIT_ACCESS(CPUDOZE,5)
// SSP1CON2<RSEN1>
extern volatile __bit                   RSEN1               __at(0x7CB1);	// @ (0xF96 * 8 + 1)
#define                                 RSEN1_bit           _BIT_ACCESS(SSP1CON2,1)
// SSP2CON2<RSEN2>
extern volatile __bit                   RSEN2               __at(0x7491);	// @ (0xE92 * 8 + 1)
#define                                 RSEN2_bit           _BIT_ACCESS(SSP2CON2,1)
// PCON1<RVREG>
extern volatile __bit                   RVREG               __at(0x7EB2);	// @ (0xFD6 * 8 + 2)
#define                                 RVREG_bit           _BIT_ACCESS(PCON1,2)
// SSP1STAT<RW1>
extern volatile __bit                   RW1                 __at(0x7CA2);	// @ (0xF94 * 8 + 2)
#define                                 RW1_bit             _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<RW2>
extern volatile __bit                   RW2                 __at(0x7482);	// @ (0xE90 * 8 + 2)
#define                                 RW2_bit             _BIT_ACCESS(SSP2STAT,2)
// PCON0<RWDT>
extern volatile __bit                   RWDT                __at(0x7EBC);	// @ (0xFD7 * 8 + 4)
#define                                 RWDT_bit            _BIT_ACCESS(PCON0,4)
// RX2PPS<RX2PPS0>
extern volatile __bit                   RX2PPS0             __at(0x7440);	// @ (0xE88 * 8 + 0)
#define                                 RX2PPS0_bit         _BIT_ACCESS(RX2PPS,0)
// RX2PPS<RX2PPS1>
extern volatile __bit                   RX2PPS1             __at(0x7441);	// @ (0xE88 * 8 + 1)
#define                                 RX2PPS1_bit         _BIT_ACCESS(RX2PPS,1)
// RX2PPS<RX2PPS2>
extern volatile __bit                   RX2PPS2             __at(0x7442);	// @ (0xE88 * 8 + 2)
#define                                 RX2PPS2_bit         _BIT_ACCESS(RX2PPS,2)
// RX2PPS<RX2PPS3>
extern volatile __bit                   RX2PPS3             __at(0x7443);	// @ (0xE88 * 8 + 3)
#define                                 RX2PPS3_bit         _BIT_ACCESS(RX2PPS,3)
// RX2PPS<RX2PPS4>
extern volatile __bit                   RX2PPS4             __at(0x7444);	// @ (0xE88 * 8 + 4)
#define                                 RX2PPS4_bit         _BIT_ACCESS(RX2PPS,4)
// RX1PPS<RXPPS0>
extern volatile __bit                   RXPPS0              __at(0x7580);	// @ (0xEB0 * 8 + 0)
#define                                 RXPPS0_bit          _BIT_ACCESS(RX1PPS,0)
// RX1PPS<RXPPS1>
extern volatile __bit                   RXPPS1              __at(0x7581);	// @ (0xEB0 * 8 + 1)
#define                                 RXPPS1_bit          _BIT_ACCESS(RX1PPS,1)
// RX1PPS<RXPPS2>
extern volatile __bit                   RXPPS2              __at(0x7582);	// @ (0xEB0 * 8 + 2)
#define                                 RXPPS2_bit          _BIT_ACCESS(RX1PPS,2)
// RX1PPS<RXPPS3>
extern volatile __bit                   RXPPS3              __at(0x7583);	// @ (0xEB0 * 8 + 3)
#define                                 RXPPS3_bit          _BIT_ACCESS(RX1PPS,3)
// RX1PPS<RXPPS4>
extern volatile __bit                   RXPPS4              __at(0x7584);	// @ (0xEB0 * 8 + 4)
#define                                 RXPPS4_bit          _BIT_ACCESS(RX1PPS,4)
// SSP1STAT<R_NOT_W1>
extern volatile __bit                   R_NOT_W1            __at(0x7CA2);	// @ (0xF94 * 8 + 2)
#define                                 R_NOT_W1_bit        _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<R_NOT_W2>
extern volatile __bit                   R_NOT_W2            __at(0x7482);	// @ (0xE90 * 8 + 2)
#define                                 R_NOT_W2_bit        _BIT_ACCESS(SSP2STAT,2)
// SSP1STAT<R_W1>
extern volatile __bit                   R_W1                __at(0x7CA2);	// @ (0xF94 * 8 + 2)
#define                                 R_W1_bit            _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<R_W2>
extern volatile __bit                   R_W2                __at(0x7482);	// @ (0xE90 * 8 + 2)
#define                                 R_W2_bit            _BIT_ACCESS(SSP2STAT,2)
// SSP1STAT<R_nW1>
extern volatile __bit                   R_nW1               __at(0x7CA2);	// @ (0xF94 * 8 + 2)
#define                                 R_nW1_bit           _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<R_nW2>
extern volatile __bit                   R_nW2               __at(0x7482);	// @ (0xE90 * 8 + 2)
#define                                 R_nW2_bit           _BIT_ACCESS(SSP2STAT,2)
// BORCON<SBOREN>
extern volatile __bit                   SBOREN              __at(0x76DF);	// @ (0xEDB * 8 + 7)
#define                                 SBOREN_bit          _BIT_ACCESS(BORCON,7)
// SCANCON0<SCANBUSY>
extern volatile __bit                   SCANBUSY            __at(0x7A55);	// @ (0xF4A * 8 + 5)
#define                                 SCANBUSY_bit        _BIT_ACCESS(SCANCON0,5)
// SCANCON0<SCANEN>
extern volatile __bit                   SCANEN              __at(0x7A57);	// @ (0xF4A * 8 + 7)
#define                                 SCANEN_bit          _BIT_ACCESS(SCANCON0,7)
// SCANCON0<SCANGO>
extern volatile __bit                   SCANGO              __at(0x7A56);	// @ (0xF4A * 8 + 6)
#define                                 SCANGO_bit          _BIT_ACCESS(SCANCON0,6)
// SCANHADRL<SCANHADR0>
extern volatile __bit                   SCANHADR0           __at(0x7A38);	// @ (0xF47 * 8 + 0)
#define                                 SCANHADR0_bit       _BIT_ACCESS(SCANHADRL,0)
// SCANHADRL<SCANHADR1>
extern volatile __bit                   SCANHADR1           __at(0x7A39);	// @ (0xF47 * 8 + 1)
#define                                 SCANHADR1_bit       _BIT_ACCESS(SCANHADRL,1)
// SCANHADRH<SCANHADR10>
extern volatile __bit                   SCANHADR10          __at(0x7A42);	// @ (0xF48 * 8 + 2)
#define                                 SCANHADR10_bit      _BIT_ACCESS(SCANHADRH,2)
// SCANHADRH<SCANHADR11>
extern volatile __bit                   SCANHADR11          __at(0x7A43);	// @ (0xF48 * 8 + 3)
#define                                 SCANHADR11_bit      _BIT_ACCESS(SCANHADRH,3)
// SCANHADRH<SCANHADR12>
extern volatile __bit                   SCANHADR12          __at(0x7A44);	// @ (0xF48 * 8 + 4)
#define                                 SCANHADR12_bit      _BIT_ACCESS(SCANHADRH,4)
// SCANHADRH<SCANHADR13>
extern volatile __bit                   SCANHADR13          __at(0x7A45);	// @ (0xF48 * 8 + 5)
#define                                 SCANHADR13_bit      _BIT_ACCESS(SCANHADRH,5)
// SCANHADRH<SCANHADR14>
extern volatile __bit                   SCANHADR14          __at(0x7A46);	// @ (0xF48 * 8 + 6)
#define                                 SCANHADR14_bit      _BIT_ACCESS(SCANHADRH,6)
// SCANHADRH<SCANHADR15>
extern volatile __bit                   SCANHADR15          __at(0x7A47);	// @ (0xF48 * 8 + 7)
#define                                 SCANHADR15_bit      _BIT_ACCESS(SCANHADRH,7)
// SCANHADRU<SCANHADR16>
extern volatile __bit                   SCANHADR16          __at(0x7A48);	// @ (0xF49 * 8 + 0)
#define                                 SCANHADR16_bit      _BIT_ACCESS(SCANHADRU,0)
// SCANHADRU<SCANHADR17>
extern volatile __bit                   SCANHADR17          __at(0x7A49);	// @ (0xF49 * 8 + 1)
